experiments/opengauss/huawei7/validation/model_calibration_20260824/sysbench-default-vs-recommended-20260826/recommended-r2.sysbench.log
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 6855.80 qps: 110713.41 (r/w/o: 96885.97/0.00/13827.44) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 7958.70 qps: 127235.25 (r/w/o: 111315.84/0.00/15919.41) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 7687.90 qps: 123184.38 (r/w/o: 107808.57/0.00/15375.80) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 7527.51 qps: 120498.25 (r/w/o: 105442.22/0.00/15056.03) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 7581.97 qps: 121364.44 (r/w/o: 106194.51/0.00/15169.93) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 7376.84 qps: 117907.40 (r/w/o: 103156.71/0.00/14750.68) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 7942.22 qps: 127277.20 (r/w/o: 111387.77/0.00/15889.43) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 8268.60 qps: 132137.69 (r/w/o: 115604.48/0.00/16533.20) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 8218.06 qps: 131789.00 (r/w/o: 115350.89/0.00/16438.12) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 8160.52 qps: 130375.25 (r/w/o: 114054.22/0.00/16321.03) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 128 tps: 7876.61 qps: 126155.64 (r/w/o: 110402.43/0.00/15753.21) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 128 tps: 7841.19 qps: 125374.11 (r/w/o: 109697.72/0.00/15676.39) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 128 tps: 7580.62 qps: 121248.87 (r/w/o: 106084.63/0.00/15164.24) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 128 tps: 7370.44 qps: 117947.96 (r/w/o: 103206.09/0.00/14741.87) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 7892.34 qps: 126385.26 (r/w/o: 110597.59/0.00/15787.67) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 128 tps: 8204.53 qps: 131265.42 (r/w/o: 114858.37/0.00/16407.05) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 128 tps: 8340.84 qps: 133326.55 (r/w/o: 116644.87/0.00/16681.67) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 128 tps: 8268.87 qps: 132487.14 (r/w/o: 115947.40/0.00/16539.74) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 128 tps: 7871.61 qps: 125880.86 (r/w/o: 110141.63/0.00/15739.23) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 7751.32 qps: 124038.09 (r/w/o: 108533.45/0.00/15504.64) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 128 tps: 7495.64 qps: 119723.19 (r/w/o: 104730.92/0.00/14992.27) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 128 tps: 7332.43 qps: 117226.99 (r/w/o: 102566.12/0.00/14660.87) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 128 tps: 7896.04 qps: 126717.73 (r/w/o: 110924.65/0.00/15793.07) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 128 tps: 8311.08 qps: 132917.31 (r/w/o: 116292.14/0.00/16625.16) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 128 tps: 8258.09 qps: 131912.53 (r/w/o: 115402.34/0.00/16510.18) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 128 tps: 8240.08 qps: 132018.99 (r/w/o: 115533.85/0.00/16485.15) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 128 tps: 7854.33 qps: 125575.06 (r/w/o: 109872.42/0.00/15702.64) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 128 tps: 7790.42 qps: 124543.63 (r/w/o: 108960.80/0.00/15582.83) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 128 tps: 7563.18 qps: 121107.78 (r/w/o: 105978.43/0.00/15129.35) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 7400.58 qps: 118515.30 (r/w/o: 103713.14/0.00/14802.16) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 128 tps: 7869.38 qps: 125962.16 (r/w/o: 110225.39/0.00/15736.76) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 128 tps: 8291.87 qps: 132422.32 (r/w/o: 115842.58/0.00/16579.75) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 128 tps: 8164.80 qps: 130634.86 (r/w/o: 114303.25/0.00/16331.61) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 128 tps: 8281.36 qps: 132571.66 (r/w/o: 116004.95/0.00/16566.71) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 128 tps: 7977.14 qps: 127431.98 (r/w/o: 111481.70/0.00/15950.28) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 128 tps: 7786.07 qps: 124749.13 (r/w/o: 109175.98/0.00/15573.15) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 128 tps: 7590.52 qps: 121404.34 (r/w/o: 106218.29/0.00/15186.05) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 128 tps: 7343.90 qps: 117448.44 (r/w/o: 102767.64/0.00/14680.81) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 128 tps: 7709.06 qps: 123579.98 (r/w/o: 108154.86/0.00/15425.12) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 8273.39 qps: 132204.04 (r/w/o: 115658.26/0.00/16545.78) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 128 tps: 8244.96 qps: 132028.35 (r/w/o: 115536.43/0.00/16491.92) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 128 tps: 8215.96 qps: 131402.38 (r/w/o: 114981.45/0.00/16420.92) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 128 tps: 7892.02 qps: 126133.22 (r/w/o: 110347.19/0.00/15786.04) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 128 tps: 7725.00 qps: 123868.63 (r/w/o: 108412.63/0.00/15456.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 128 tps: 7462.65 qps: 119125.87 (r/w/o: 104205.59/0.00/14920.28) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 128 tps: 7391.25 qps: 118357.96 (r/w/o: 103574.45/0.00/14783.51) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 128 tps: 7792.93 qps: 124853.81 (r/w/o: 109262.94/0.00/15590.87) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 128 tps: 8206.96 qps: 131138.10 (r/w/o: 114726.19/0.00/16411.91) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 128 tps: 8252.00 qps: 132134.01 (r/w/o: 115630.02/0.00/16503.99) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 8200.80 qps: 131157.75 (r/w/o: 114762.16/0.00/16395.59) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 128 tps: 7862.97 qps: 125922.50 (r/w/o: 110193.56/0.00/15728.93) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 128 tps: 7832.52 qps: 125298.37 (r/w/o: 109634.32/0.00/15664.04) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 128 tps: 7526.48 qps: 120287.69 (r/w/o: 105240.73/0.00/15046.96) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 128 tps: 7409.80 qps: 118598.91 (r/w/o: 103768.29/0.00/14830.62) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 128 tps: 7772.59 qps: 124450.42 (r/w/o: 108908.23/0.00/15542.19) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 128 tps: 8205.59 qps: 131283.38 (r/w/o: 114875.21/0.00/16408.17) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 128 tps: 8237.62 qps: 131865.97 (r/w/o: 115381.73/0.00/16484.25) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 128 tps: 8237.51 qps: 131786.10 (r/w/o: 115319.09/0.00/16467.01) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 128 tps: 7952.69 qps: 127059.95 (r/w/o: 111151.58/0.00/15908.37) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 7846.39 qps: 125506.22 (r/w/o: 109813.44/0.00/15692.78) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 128 tps: 7599.15 qps: 121687.36 (r/w/o: 106488.07/0.00/15199.29) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 128 tps: 7301.41 qps: 116890.54 (r/w/o: 102287.72/0.00/14602.82) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 128 tps: 7778.22 qps: 124452.45 (r/w/o: 108895.02/0.00/15557.43) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 128 tps: 8286.32 qps: 132439.07 (r/w/o: 115868.43/0.00/16570.64) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 128 tps: 8275.21 qps: 132425.38 (r/w/o: 115873.95/0.00/16551.42) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 128 tps: 8263.48 qps: 132335.58 (r/w/o: 115806.62/0.00/16528.96) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 128 tps: 7999.31 qps: 127912.10 (r/w/o: 111917.47/0.00/15994.63) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 128 tps: 7762.99 qps: 124090.70 (r/w/o: 108567.73/0.00/15522.97) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 128 tps: 7623.26 qps: 121876.07 (r/w/o: 106625.54/0.00/15250.53) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 7407.67 qps: 118516.72 (r/w/o: 103707.38/0.00/14809.34) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 128 tps: 7633.48 qps: 122375.63 (r/w/o: 107099.68/0.00/15275.95) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 128 tps: 8262.77 qps: 132129.35 (r/w/o: 115604.81/0.00/16524.55) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 128 tps: 8306.84 qps: 133088.31 (r/w/o: 116477.64/0.00/16610.68) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 128 tps: 8247.73 qps: 131736.57 (r/w/o: 115243.11/0.00/16493.46) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 128 tps: 7922.55 qps: 126795.79 (r/w/o: 110952.69/0.00/15843.10) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 128 tps: 7876.44 qps: 126072.99 (r/w/o: 110316.11/0.00/15756.87) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 128 tps: 7621.15 qps: 121924.39 (r/w/o: 106681.09/0.00/15243.30) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 128 tps: 7414.55 qps: 118688.67 (r/w/o: 103858.58/0.00/14830.09) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 128 tps: 7734.58 qps: 123865.40 (r/w/o: 108398.24/0.00/15467.16) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 8179.43 qps: 130667.81 (r/w/o: 114310.95/0.00/16356.86) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8818712
        write:                           0
        other:                           1259816
        total:                           10078528
    transactions:                        629908 (7869.59 per sec.)
    queries:                             10078528 (125913.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          80.0422s
    total number of events:              629908

Latency (ms):
         min:                                    1.74
         avg:                                   16.26
         max:                                   83.94
         95th percentile:                       20.00
         sum:                             10240050.55

Threads fairness:
    events (avg/stddev):           4921.1562/69.59
    execution time (avg/stddev):   80.0004/0.01